<!-- add-pr-comment:eks_plan -->

# staging/eks Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_cloudwatch_log_metric_filter.celery-error-duplicate-record[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "celery-error-duplicate-record" {
        id                        = "celery-error-duplicate-record"
        name                      = "celery-error-duplicate-record"
      ~ pattern                   = "\"CELERY_KNOWN_ERROR::DUPLICATE_RECORD\"" -> "\"duplicate key value violates unique constraint\""
        # (3 unchanged attributes hidden)
        # (1 unchanged block hidden)
    }
  # aws_cloudwatch_log_metric_filter.celery-error-timeout[0] will be destroyed
  # (because aws_cloudwatch_log_metric_filter.celery-error-timeout is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "celery-error-timeout" {
      - apply_on_transformed_logs = false -> null
      - id                        = "celery-error-timeout" -> null
      - log_group_name            = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application" -> null
      - name                      = "celery-error-timeout" -> null
      - pattern                   = "\"CELERY_KNOWN_ERROR::TIMEOUT\"" -> null
      - region                    = "ca-central-1" -> null
      - metric_transformation {
          - dimensions    = {} -> null
          - name          = "celery-error-timeout" -> null
          - namespace     = "LogMetrics" -> null
          - unit          = "None" -> null
          - value         = "1" -> null
            # (1 unchanged attribute hidden)
        }
    }
  # aws_cloudwatch_log_metric_filter.celery-error-timeout-client[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "celery-error-timeout-client" {
      + apply_on_transformed_logs = (known after apply)
      + id                        = (known after apply)
      + log_group_name            = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name                      = "celery-error-timeout-client"
      + pattern                   = "\"CELERY_KNOWN_ERROR::TIMEOUT_CLIENT\""
      + region                    = "ca-central-1"
      + metric_transformation {
          + name      = "celery-error-timeout-client"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }
  # aws_cloudwatch_log_metric_filter.celery-error-timeout-notification[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "celery-error-timeout-notification" {
      + apply_on_transformed_logs = (known after apply)
      + id                        = (known after apply)
      + log_group_name            = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name                      = "celery-error-timeout-notification"
      + pattern                   = "\"CELERY_KNOWN_ERROR::TIMEOUT_NOTIFICATION\""
      + region                    = "ca-central-1"
      + metric_transformation {
          + name      = "celery-error-timeout-notification"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-timeout-client-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-timeout-client-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Critical for client timeout errors in 1 minute"
      + alarm_name                            = "logs-celery-error-timeout-client-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-timeout-client"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-timeout-client-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-timeout-client-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Warning client timeout error in 1 minute"
      + alarm_name                            = "logs-celery-error-timeout-client-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-timeout-client"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-timeout-critical[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.logs-celery-error-timeout-critical is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "logs-celery-error-timeout-critical" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ] -> null
      - alarm_description                     = "Ten Celery timeout errors in 1 minute" -> null
      - alarm_name                            = "logs-celery-error-timeout-critical" -> null
      - arn                                   = "arn:aws:cloudwatch:ca-central-1:239043911459:alarm:logs-celery-error-timeout-critical" -> null
      - comparison_operator                   = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "logs-celery-error-timeout-critical" -> null
      - insufficient_data_actions             = [] -> null
      - metric_name                           = "celery-error-timeout" -> null
      - namespace                             = "LogMetrics" -> null
      - ok_actions                            = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ] -> null
      - period                                = 60 -> null
      - region                                = "ca-central-1" -> null
      - statistic                             = "Sum" -> null
      - tags                                  = {} -> null
      - tags_all                              = {} -> null
      - threshold                             = 10 -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (4 unchanged attributes hidden)
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-timeout-notification-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-timeout-notification-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Critical notification timeout errors in 1 minute"
      + alarm_name                            = "logs-celery-error-timeout-notification-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-timeout-notification"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-timeout-notification-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-timeout-notification-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Warning notification timeout error in 1 minute"
      + alarm_name                            = "logs-celery-error-timeout-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-timeout-notification"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-timeout-warning[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.logs-celery-error-timeout-warning is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "logs-celery-error-timeout-warning" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ] -> null
      - alarm_description                     = "One Celery timeout error in 1 minute" -> null
      - alarm_name                            = "logs-celery-error-timeout-warning" -> null
      - arn                                   = "arn:aws:cloudwatch:ca-central-1:239043911459:alarm:logs-celery-error-timeout-warning" -> null
      - comparison_operator                   = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "logs-celery-error-timeout-warning" -> null
      - insufficient_data_actions             = [] -> null
      - metric_name                           = "celery-error-timeout" -> null
      - namespace                             = "LogMetrics" -> null
      - ok_actions                            = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ] -> null
      - period                                = 60 -> null
      - region                                = "ca-central-1" -> null
      - statistic                             = "Sum" -> null
      - tags                                  = {} -> null
      - tags_all                              = {} -> null
      - threshold                             = 1 -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (4 unchanged attributes hidden)
    }
Plan: 6 to add, 1 to change, 3 to destroy.

# --- End of Plan 1 ---